# 1
# Напишите функцию is_prime(n),
# которая принимает целое число и возвращает True,
# если число является простым, и False в противном случае.

def is_prime(n):
    pass


print(is_prime(7))  # Вывод: True
print(is_prime(10))  # Вывод: False

