
# 2.1
# Напишите итеративную функцию iter_fib(n), которая возвращает n-е число Фибоначчи.


def iter_fib(n):
    pass


print(iter_fib(6))  # Вывод: 8


# 2.2
# Напишите рекурсивную функцию rec_fib(n), которая возвращает n-е число Фибоначчи.


def rec_fib(n):
    pass


print(rec_fib(6))  # Вывод: 8
