

# 3
# Реализуйте декоратор memoize, который кеширует результаты вызовов функции.
# Декоратор должен работать с функциями, принимающими любые позиционные аргументы.
# Примените этот декоратор к рекурсивной функции
# вычисления чисел Фибоначчи для оптимизации вычислений.
def memoize(func):
    def inner(n):
        pass


print(rec_fib(50))  # Вывод: 12586269025


