# 4
# Напишите функцию concat(*args),
# которая принимает произвольное количество строковых аргументов
# и возвращает их объединение в одну строку.

def concat(*args):
    pass


print(concat("Hello", " ", "World", "!"))  # Вывод: "Hello World!"


