# 5
# Напишите функцию find_max(*args), которая принимает произвольное количество
# числовых аргументов и возвращает максимальное из них.

def find_max(*args):
    pass


print(find_max(3, 5, 7, 2, 8))  # Вывод: 8


